Repository: ayushchoubey62/Crop-Detection
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: hi, kn, mr

source: Diagnose
hi: निदान
kn: ರೋಗನಿರ್ಣಯ
mr: निदान

source: History
hi: इतिहास
kn: ಇತಿಹಾಸ
mr: इतिहास

source: Feedback
hi: प्रतिक्रिया
kn: ಪ್ರತಿಕ್ರಿಯೆ
mr: प्रतिक्रिया

source: Help
hi: सहायता
kn: ಸಹಾಯ
mr: मदत

source: Community
hi: समुदाय
kn: ಸಮುದಾಯ
mr: समुदाय

source: About
hi: हमारे बारे में
kn: ನಮ್ಮ ಬಗ್ಗೆ
mr: आमच्याबद्दल

source: Library
hi: लाइब्रेरी
kn: ಗ್ರಂಥಾಲಯ
mr: लायब्ररी

source: Schemes
hi: योजनाएं
kn: ಯೋಜನೆಗಳು
mr: योजना

source: Crop Doctor AI
hi: क्रॉप डॉक्टर एआई
kn: ಕ್ರಾಪ್ ಡಾಕ್ಟರ್ ಎಐ
mr: पीक डॉक्टर एआय

source: Empowering farmers with advanced AI to detect crop diseases early, estimate yields, and protect harvests.
hi: किसानों को फसल रोगों का जल्द पता लगाने, उपज का अनुमान लगाने और फसलों की सुरक्षा के लिए उन्नत एआई के साथ सशक्त बनाना।
kn: ಬೆಳೆ ರೋಗಗಳನ್ನು ಮೊದಲೇ ಪತ್ತೆಹಚ್ಚಲು, ಇಳುವರಿಯನ್ನು ಅಂದಾಜು ಮಾಡಲು ಮತ್ತು ಬೆಳೆಗಳನ್ನು ರಕ್ಷಿಸಲು ಸುಧಾರಿತ AI ನೊಂದಿಗೆ ರೈತರನ್ನು ಸಬಲೀಕರಣಗೊಳಿಸುವುದು.
mr: पीक रोगांचे लवकर निदान करण्यासाठी, उत्पन्नाचा अंदाज घेण्यासाठी आणि पिकांचे संरक्षण करण्यासाठी प्रगत एआय (AI) सह शेतकऱ्यांना सक्षम करणे.

source: Product
hi: उत्पाद
kn: ಉತ್ಪನ್ನ
mr: उत्पादन

source: Smart Diagnosis
hi: स्मार्ट निदान
kn: ಸ್ಮಾರ್ಟ್ ರೋಗನಿರ್ಣಯ
mr: स्मार्ट निदान

source: History Log
hi: इतिहास लॉग
kn: ಇತಿಹಾಸ ಲಾಗ್
mr: इतिहास लॉग

source: Community Forum
hi: समुदाय मंच
kn: ಸಮುದಾಯ ವೇದಿಕೆ
mr: समुदाय मंच

source: Resources
hi: संसाधन
kn: ಸಂಪನ್ಮೂಲಗಳು
mr: संसाधने

source: Help Center
hi: सहायता केंद्र
kn: ಸಹಾಯ ಕೇಂದ್ರ
mr: मदत केंद्र

source: Government Schemes
hi: सरकारी योजनाएं
kn: ಸರ್ಕಾರಿ ಯೋಜನೆಗಳು
mr: शासकीय योजना

source: Disease Library
hi: रोग पुस्तकालय
kn: ರೋಗ ಗ್ರಂಥಾಲಯ
mr: रोग लायब्ररी

source: About Us
hi: हमारे बारे में
kn: ನಮ್ಮ ಬಗ್ಗೆ
mr: आमच्याबद्दल

source: Support
hi: समर्थन
kn: ಬೆಂಬಲ
mr: समर्थन

source: All rights reserved.
hi: सर्वाधिकार सुरक्षित।
kn: ಎಲ್ಲಾ ಹಕ್ಕುಗಳನ್ನು ಕಾಯ್ದಿರಿಸಲಾಗಿದೆ.
mr: सर्व हक्क राखीव.

source: Privacy Policy
hi: गोपनीयता नीति
kn: ಗೌಪ್ಯತಾ ನೀತಿ
mr: गोपनीयता धोरण

source: Terms of Service
hi: सेवा की शर्तें
kn: ಸೇವಾ ನಿಯಮಗಳು
mr: सेवा अटी

source: Community & Expert Hub
hi: समुदाय और विशेषज्ञ केंद्र
kn: ಸಮುದಾಯ ಮತ್ತು ತಜ್ಞರ ಹಬ್
mr: समुदाय आणि तज्ञ हब

source: Connect with experts and other farmers to solve crop issues.
hi: फसल संबंधी समस्याओं को हल करने के लिए विशेषज्ञों और अन्य किसानों से जुड़ें।
kn: ಬೆಳೆ ಸಮಸ್ಯೆಗಳನ್ನು ಬಗೆಹರಿಸಲು ತಜ್ಞರು ಮತ್ತು ಇತರ ರೈತರೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಿ.
mr: पीक समस्या सोडवण्यासाठी तज्ञ आणि इतर शेतकऱ्यांशी जोडा.

source: Are you a Doctor? Join as Expert
hi: क्या आप डॉक्टर हैं? विशेषज्ञ के रूप में शामिल हों
kn: ನೀವು ವೈದ್ಯರೇ? ತಜ್ಞರಾಗಿ ಸೇರಿಕೊಳ್ಳಿ
mr: तुम्ही डॉक्टर आहात का? तज्ञ म्हणून सामील व्हा

source: Total Issues
hi: कुल समस्याएं
kn: ಒಟ್ಟು ಸಮಸ್ಯೆಗಳು
mr: एकूण समस्या

source: Expert Verified
hi: विशेषज्ञ द्वारा सत्यापित
kn: ತಜ್ಞರಿಂದ ಪರಿಶೀಲಿಸಲಾಗಿದೆ
mr: तज्ञांनी सत्यापित केलेले

source: Pending Review
hi: समीक्षा लंबित
kn: ಪರಿಶೀಲನೆ ಬಾಕಿ ಇದೆ
mr: पुनरावलोकन प्रलंबित

source: Search crops, diseases, or questions...
hi: फसलें, रोग या प्रश्न खोजें...
kn: ಬೆಳೆಗಳು, ರೋಗಗಳು ಅಥವಾ ಪ್ರಶ್ನೆಗಳನ್ನು ಹುಡುಕಿ...
mr: पिके, रोग किंवा प्रश्न शोधा...

source: All Posts
hi: सभी पोस्ट
kn: ಎಲ್ಲಾ ಪೋಸ್ಟ್‌ಗಳು
mr: सर्व पोस्ट

source: Verified
hi: सत्यापित
kn: ಪರಿಶೀಲಿಸಲಾಗಿದೆ
mr: सत्यापित

source: Pending
hi: लंबित
kn: ಬಾಕಿ ಉಳಿದಿದೆ
mr: प्रलंबित

source: No posts found
hi: कोई पोस्ट नहीं मिली
kn: ಯಾವುದೇ ಪೋಸ್ಟ್‌ಗಳು ಕಂಡುಬಂದಿಲ್ಲ
mr: कोणत्याही पोस्ट आढळल्या नाहीत

source: Try adjusting your search filters.
hi: अपने खोज फिल्टर को समायोजित करने का प्रयास करें।
kn: ನಿಮ್ಮ ಹುಡುಕಾಟ ಫಿಲ್ಟರ್‌ಗಳನ್ನು ಸರಿಹೊಂದಿಸಲು ಪ್ರಯತ್ನಿಸಿ.
mr: तुमचे शोध फिल्टर समायोजित करण्याचा प्रयत्न करा.

source: Join as an Expert
hi: विशेषज्ञ के रूप में शामिल हों
kn: ತಜ್ಞರಾಗಿ ಸೇರಿಕೊಳ್ಳಿ
mr: तज्ञ म्हणून सामील व्हा

source: Verify your identity to get the
hi: अपनी पहचान सत्यापित करें और
kn: ಪಡೆಯಲು ನಿಮ್ಮ ಗುರುತನ್ನು ಪರಿಶೀಲಿಸಿ
mr: मिळवण्यासाठी तुमची ओळख सत्यापित करा

source: Green Badge
hi: ग्रीन बैज
kn: ಹಸಿರು ಬ್ಯಾಡ್ಜ್
mr: ग्रीन बॅज

source: and help farmers.
hi: किसानों की मदद करें।
kn: ಮತ್ತು ರೈತರಿಗೆ ಸಹಾಯ ಮಾಡಿ.
mr: आणि शेतकऱ्यांना मदत करा.

source: Full Name
hi: पूरा नाम
kn: ಪೂರ್ಣ ಹೆಸರು
mr: पूर्ण नाव

source: I am a...
hi: मैं एक...
kn: ನಾನು ಒಬ್ಬ...
mr: मी एक आहे...

source: Doctor / Pathologist (Dr.)
hi: डॉक्टर / पैथोलॉजिस्ट (डॉ.)
kn: ವೈದ್ಯರು / ರೋಗಶಾಸ್ತ್ರಜ್ಞರು (ಡಾ.)
mr: डॉक्टर / पॅथॉलॉजिस्ट (डॉ.)

source: Medical/Agri Shop Owner
hi: मेडिकल/एग्री शॉप मालिक
kn: ವೈದ್ಯಕೀಯ/ಕೃಷಿ ಅಂಗಡಿ ಮಾಲೀಕರು
mr: मेडिकल/कृषी दुकान मालक

source: Agronomist / Scientist
hi: कृषिविज्ञानी / वैज्ञानिक
kn: ಕೃಷಿ ವಿಜ್ಞಾನಿ / ವಿಜ್ಞಾನಿ
mr: कृषीशास्त्रज्ञ / शास्त्रज्ञ

source: Email Address
hi: ईमेल पता
kn: ಇಮೇಲ್ ವಿಳಾಸ
mr: ईमेल पत्ता

source: Verification Details
hi: सत्यापन विवरण
kn: ಪರಿಶೀಲನೆ ವಿವರಗಳು
mr: सत्यापन तपशील

source: Submit Application
hi: आवेदन जमा करें
kn: ಅರ್ಜಿ ಸಲ್ಲಿಸಿ
mr: अर्ज सबमिट करा

source: Crop Disease Diagnosis
hi: फसल रोग निदान
kn: ಬೆಳೆ ರೋಗ ಪತ್ತೆ
mr: पीक रोग निदान

source: Image Tools
hi: छवि उपकरण
kn: ಚಿತ್ರ ಪರಿಕರಗಳು
mr: इमेज टूल्स

source: Upload Image
hi: छवि अपलोड करें
kn: ಚಿತ್ರವನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡಿ
mr: फोटो अपलोड करा

source: Clear Image
hi: छवि साफ़ करें
kn: ಚಿತ್ರವನ್ನು ತೆರವುಗೊಳಿಸಿ
mr: फोटो साफ करा

source: Live Preview
hi: लाइव पूर्वावलोकन
kn: ಲೈವ್ ಮುನ್ನೋಟ
mr: थेट पूर्वावलोकन

source: Field Mode (Offline)
hi: फील्ड मोड (ऑफलाइन)
kn: ಫೀಲ್ಡ್ ಮೋಡ್ (ಆಫ್‌ಲೈನ್)
mr: फील्ड मोड (ऑफलाइन)

source: Crop Image
hi: छवि क्रॉप करें
kn: ಚಿತ್ರವನ್ನು ಕ್ರಾಪ್ ಮಾಡಿ
mr: फोटो क्रॉप करा

source: Apply Crop
hi: क्रॉप लागू करें
kn: ಕ್ರಾಪ್ ಅನ್ವಯಿಸಿ
mr: क्रॉप लागू करा

source: Reset Crop
hi: क्रॉप रीसेट करें
kn: ಕ್ರಾಪ್ ಮರುಹೊಂದಿಸಿ
mr: क्रॉप रीसेट करा

source: Ready to upload image
hi: छवि अपलोड करने के लिए तैयार
kn: ಚಿತ್ರ ಅಪ್‌ಲೋಡ್ ಮಾಡಲು ಸಿದ್ಧವಾಗಿದೆ
mr: फोटो अपलोड करण्यास तयार

source: Image Preview
hi: छवि पूर्वावलोकन
kn: ಚಿತ್ರ ಮುನ್ನೋಟ
mr: इमेज पूर्वावलोकन

source: No image uploaded
hi: कोई छवि अपलोड नहीं की गई
kn: ಯಾವುದೇ ಚಿತ್ರ ಅಪ್‌ಲೋಡ್ ಆಗಿಲ್ಲ
mr: कोणतीही इमेज अपलोड केलेली नाही

source: Compare Original
hi: मूल से तुलना करें
kn: ಮೂಲದೊಂದಿಗೆ ಹೋಲಿಸಿ
mr: मूळशी तुलना करा

source: Diagnosis Results
hi: निदान परिणाम
kn: ರೋಗನಿರ್ಣಯ ಫಲಿತಾಂಶಗಳು
mr: निदान परिणाम

source: No diagnosis available. Upload an image to start.
hi: कोई निदान उपलब्ध नहीं है। शुरू करने के लिए एक छवि अपलोड करें।
kn: ಯಾವುದೇ ರೋಗನಿರ್ಣಯ ಲಭ್ಯವಿಲ್ಲ. ಪ್ರಾರಂಭಿಸಲು ಚಿತ್ರವನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡಿ.
mr: कोणतेही निदान उपलब्ध नाही. सुरू करण्यासाठी फोटो अपलोड करा.

source: Image Enhancement Tools
hi: छवि वृद्धि उपकरण
kn: ಚಿತ್ರ ವರ್ಧನೆ ಪರಿಕರಗಳು
mr: इमेज सुधारणा साधने

source: Basic Adjustments
hi: बुनियादी समायोजन
kn: ಮೂಲ ಹೊಂದಾಣಿಕೆಗಳು
mr: मूलभूत समायोजने

source: Brightness
hi: चमक
kn: ಪ್ರಕಾಶಮಾನ (Brightness)
mr: ब्राइटनेस

source: Contrast
hi: कंट्रास्ट
kn: ವ್ಯತ್ಯಾಸ (Contrast)
mr: कॉन्ट्रास्ट

source: Saturation
hi: संतृप्ति
kn: ಸ್ಯಾಚುರೇಶನ್
mr: सॅच्युरेशन

source: Advanced Adjustments
hi: उन्नत समायोजन
kn: ಸುಧಾರಿತ ಹೊಂದಾಣಿಕೆಗಳು
mr: प्रगत समायोजने

source: Edge Enhance
hi: किनारा वृद्धि
kn: ಅಂಚು ಹೆಚ್ಚಳ
mr: एज एन्हान्स

source: Blur Reduce
hi: धुंधलापन कम करें
kn: ಮಸುಕು ಕಡಿಮೆ ಮಾಡಿ
mr: ब्लर कमी करा

source: Color Balance
hi: रंग संतुलन
kn: ಬಣ್ಣ ಸಮತೋಲನ
mr: रंग संतुलन

source: Presets
hi: प्रीसेट
kn: ಪೂರ್ವನಿಗದಿಗಳು (Presets)
mr: प्रीसेट

source: Auto Contrast
hi: ऑटो कंट्रास्ट
kn: ಸ್ವಯಂ ಕಾಂಟ್ರಾಸ್ಟ್
mr: ऑटो कॉन्ट्रास्ट

source: Sharpen
hi: तेज करें (Sharpen)
kn: ತೀಕ್ಷ್ಣಗೊಳಿಸಿ (Sharpen)
mr: शार्पन

source: Grayscale
hi: ग्रेस्केल
kn: ಗ್ರೇಸ್ಕೇಲ್
mr: ग्रेस्केल

source: Reset Filters
hi: फिल्टर रीसेट करें
kn: ಫಿಲ್ಟರ್‌ಗಳನ್ನು ಮರುಹೊಂದಿಸಿ
mr: फिल्टर रीसेट करा

source: Save Report
hi: रिपोर्ट सहेजें
kn: ವರದಿ ಉಳಿಸಿ
mr: अहवाल जतन करा

source: Print Report
hi: रिपोर्ट प्रिंट करें
kn: ವರದಿ ಮುದ್ರಿಸಿ
mr: अहवाल प्रिंट करा

source: Back to Home
hi: होम पर वापस जाएं
kn: ಮುಖಪುಟಕ್ಕೆ ಹಿಂತಿರುಗಿ
mr: होम वर परत जा

source: Image uploaded. Analyzing...
hi: छवि अपलोड की गई। विश्लेषण किया जा रहा है...
kn: ಚಿತ್ರ ಅಪ್‌ಲೋಡ್ ಆಗಿದೆ. ವಿಶ್ಲೇಷಿಸಲಾಗುತ್ತಿದೆ...
mr: इमेज अपलोड केली. विश्लेषण करत आहे...

source: Analyzing on device (Offline)...
hi: डिवाइस पर विश्लेषण (ऑफलाइन)...
kn: ಸಾಧನದಲ್ಲಿ ವಿಶ್ಲೇಷಿಸಲಾಗುತ್ತಿದೆ (ಆಫ್‌ಲೈನ್)...
mr: डिव्हाइसवर विश्लेषण करत आहे (ऑफलाइन)...

source: Offline Analysis Complete
hi: ऑफलाइन विश्लेषण पूर्ण
kn: ಆಫ್‌ಲೈನ್ ವಿಶ್ಲೇಷಣೆ ಪೂರ್ಣಗೊಂಡಿದೆ
mr: ऑफलाइन विश्लेषण पूर्ण झाले

source: Environmental Risk Analysis
hi: पर्यावरण जोखिम विश्लेषण
kn: ಪರಿಸರ ಅಪಾಯದ ವಿಶ್ಲೇಷಣೆ
mr: पर्यावरण जोखीम विश्लेषण

source: Live Data
hi: लाइव डेटा
kn: ಲೈವ್ ಡೇಟಾ
mr: थेट डेटा

source: Pathogens spread differently depending on the weather. Check your farm's current risk status.
hi: मौसम के आधार पर रोगजनक अलग-अलग तरह से फैलते हैं। अपने खेत की वर्तमान जोखिम स्थिति की जाँच करें।
kn: ಹವಾಮಾನವನ್ನು ಅವಲಂಬಿಸಿ ರೋಗಕಾರಕಗಳು ವಿಭಿನ್ನವಾಗಿ ಹರಡುತ್ತವೆ. ನಿಮ್ಮ ಜಮೀನಿನ ಪ್ರಸ್ತುತ ಅಪಾಯದ ಸ್ಥಿತಿಯನ್ನು ಪರಿಶೀಲಿಸಿ.
mr: हवामानानुसार रोगजंतू वेगळ्या प्रकारे पसरतात. तुमच्या शेताची सध्याची जोखीम स्थिती तपासा.

source: Enter Farm Location (e.g. Pune)
hi: खेत का स्थान दर्ज करें (जैसे पुणे)
kn: ಜಮೀನಿನ ಸ್ಥಳವನ್ನು ನಮೂದಿಸಿ (ಉದಾ. ಪುಣೆ)
mr: शेताचे ठिकाण प्रविष्ट करा (उदा. पुणे)

source: Analyze Risk
hi: जोखिम का विश्लेषण करें
kn: ಅಪಾಯವನ್ನು ವಿಶ್ಲೇಷಿಸಿ
mr: जोखीम विश्लेषण करा

source: User Feedback & Support
hi: उपयोगकर्ता प्रतिक्रिया और सहायता
kn: ಬಳಕೆದಾರರ ಪ್ರತಿಕ್ರಿಯೆ ಮತ್ತು ಬೆಂಬಲ
mr: वापरकर्ता प्रतिक्रिया आणि समर्थन

source: Feedback Type
hi: प्रतिक्रिया का प्रकार
kn: ಪ್ರತಿಕ್ರಿಯೆಯ ಪ್ರಕಾರ
mr: प्रतिक्रियेचा प्रकार

source: Suggestion
hi: सुझाव
kn: ಸಲಹೆ
mr: सूचना

source: Bug Report
hi: बग रिपोर्ट
kn: ದೋಷ ವರದಿ
mr: बग रिपोर्ट

source: Feature Request
hi: सुविधा अनुरोध
kn: ವೈಶಿಷ್ಟ್ಯದ ವಿನಂತಿ
mr: वैशिष्ट्य विनंती

source: General Feedback
hi: सामान्य प्रतिक्रिया
kn: ಸಾಮಾನ್ಯ ಪ್ರತಿಕ್ರಿಯೆ
mr: सामान्य प्रतिक्रिया

source: Contact Email (optional):
hi: संपर्क ईमेल (वैकल्पिक):
kn: ಸಂಪರ್ಕ ಇಮೇಲ್ (ಐಚ್ಛಿಕ):
mr: संपर्क ईमेल (पर्यायी):

source: Rating
hi: रेटिंग
kn: ರೇಟಿಂಗ್
mr: रेटिंग

source: Poor
hi: खराब
kn: ಕಳಪೆ
mr: खराब

source: Fair
hi: ठीक
kn: ಪರವಾಗಿಲ್ಲ
mr: ठीक

source: Good
hi: अच्छा
kn: ಉತ್ತಮ
mr: चांगले

source: Very Good
hi: बहुत अच्छा
kn: ತುಂಬಾ ಚೆನ್ನಾಗಿದೆ
mr: खूप चांगले

source: Excellent
hi: उत्कृष्ट
kn: ಅತ್ಯುತ್ತಮ
mr: उत्कृष्ट

source: Your Feedback:
hi: आपकी प्रतिक्रिया:
kn: ನಿಮ್ಮ ಪ್ರತಿಕ್ರಿಯೆ:
mr: तुमची प्रतिक्रिया:

source: Please describe your feedback in detail...
hi: कृपया अपनी प्रतिक्रिया का विस्तार से वर्णन करें...
kn: ದಯವಿಟ್ಟು ನಿಮ್ಮ ಪ್ರತಿಕ್ರಿಯೆಯನ್ನು ವಿವರವಾಗಿ ವಿವರಿಸಿ...
mr: कृपया तुमची प्रतिक्रिया तपशीलवार वर्णन करा...

source: Attach screenshot (if applicable)
hi: स्क्रीनशॉट संलग्न करें (यदि लागू हो)
kn: ಸ್ಕ್ರೀನ್‌ಶಾಟ್ ಲಗತ್ತಿಸಿ (ಅನ್ವಯಿಸಿದರೆ)
mr: स्क्रीनशॉट जोडा (लागू असल्यास)

source: Select Screenshot
hi: स्क्रीनशॉट चुनें
kn: ಸ್ಕ್ರೀನ್‌ಶಾಟ್ ಆಯ್ಕೆಮಾಡಿ
mr: स्क्रीनशॉट निवडा

source: Submit Feedback
hi: प्रतिक्रिया जमा करें
kn: ಪ್ರತಿಕ್ರಿಯೆ ಸಲ್ಲಿಸಿ
mr: प्रतिक्रिया सबमिट करा

source: Reset Form
hi: फॉर्म रीसेट करें
kn: ಫಾರ್ಮ್ ಮರುಹೊಂದಿಸಿ
mr: फॉर्म रीसेट करा

source: Crop Disease Diagnosis Guide
hi: फसल रोग निदान गाइड
kn: ಬೆಳೆ ರೋಗ ನಿರ್ಣಯ ಮಾರ್ಗದರ್ಶಿ
mr: पीक रोग निदान मार्गदर्शक

source: Comprehensive user manual and troubleshooting guide
hi: व्यापक उपयोगकर्ता मैनुअल और समस्या निवारण गाइड
kn: ಸಮಗ್ರ ಬಳಕೆದಾರ ಕೈಪಿಡಿ ಮತ್ತು ದೋಷನಿವಾರಣೆ ಮಾರ್ಗದರ್ಶಿ
mr: सर्वसमावेशक वापरकर्ता पुस्तिका आणि ट्रबलशूटिंग मार्गदर्शक

source: Search the guide...
hi: गाइड में खोजें...
kn: ಮಾರ್ಗದರ್ಶಿಯನ್ನು ಹುಡುಕಿ...
mr: मार्गदर्शक शोधा...

source: Search
hi: खोजें
kn: ಹುಡುಕಿ
mr: शोधा

source: Table of Contents
hi: विषय - सूची
kn: ಪರಿವಿಡಿ
mr: अनुक्रमणिका

source: Print This Guide
hi: यह गाइड प्रिंट करें
kn: ಈ ಮಾರ್ಗದರ್ಶಿಯನ್ನು ಮುದ್ರಿಸಿ
mr: हे मार्गदर्शक प्रिंट करा

source: Getting Started
hi: शुरू करना
kn: ಪ್ರಾರಂಭಿಸಲಾಗುತ್ತಿದೆ
mr: सुरुवात करत आहे

source: Welcome to Crop Disease Diagnosis
hi: फसल रोग निदान में आपका स्वागत है
kn: ಬೆಳೆ ರೋಗ ನಿರ್ಣಯಕ್ಕೆ ಸುಸ್ವಾಗತ
mr: पीक रोग निदान मध्ये स्वागत आहे

source: This AI-powered application helps farmers and agricultural professionals identify diseases in crop leaves through image analysis.
hi: यह एआई-संचालित एप्लिकेशन किसानों और कृषि पेशेवरों को छवि विश्लेषण के माध्यम से फसल के पत्तों में बीमारियों की पहचान करने में मदद करता है।
kn: ಈ AI-ಚಾಲಿತ ಅಪ್ಲಿಕೇಶನ್ ರೈತರು ಮತ್ತು ಕೃಷಿ ವೃತ್ತಿಪರರಿಗೆ ಚಿತ್ರ ವಿಶ್ಲೇಷಣೆಯ ಮೂಲಕ ಬೆಳೆ ಎಲೆಗಳಲ್ಲಿನ ರೋಗಗಳನ್ನು ಗುರುತಿಸಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ.
mr: हे एआय-आधारित अॅप्लिकेशन शेतकरी आणि कृषी व्यावसायिकांना इमेज विश्लेषणाद्वारे पीक पानांमधील रोग ओळखण्यास मदत करते.

source: System Requirements
hi: सिस्टम आवश्यकताएं
kn: ಸಿಸ್ಟಂ ಅವಶ್ಯಕತೆಗಳು
mr: सिस्टम आवश्यकता

source: • Modern web browser\n• Internet connection\n• Sufficient device storage for image uploads\n• Webcam or camera for live capture (browser support dependent)
hi: • आधुनिक वेब ब्राउज़र\n• इंटरनेट कनेक्शन\n• छवि अपलोड के लिए पर्याप्त डिवाइस स्टोरेज\n• लाइव कैप्चर के लिए वेबकैम या कैमरा (ब्राउज़र पर निर्भर)
kn: • ಆಧುನಿಕ ವೆಬ್ ಬ್ರೌಸರ್\n• ಇಂಟರ್ನೆಟ್ ಸಂಪರ್ಕ\n• ಇಮೇಜ್ ಅಪ್‌ಲೋಡ್‌ಗಳಿಗಾಗಿ ಸಾಕಷ್ಟು ಸಾಧನ ಸಂಗ್ರಹಣೆ\n• ಲೈವ್ ಕ್ಯಾಪ್ಚರ್‌ಗಾಗಿ ವೆಬ್‌ಕ್ಯಾಮ್ ಅಥವಾ ಕ್ಯಾಮೆರಾ (ಬ್ರೌಸರ್ ಬೆಂಬಲವನ್ನು ಅವಲಂಬಿಸಿದೆ)
mr: • आधुनिक वेब ब्राउझर\n• इंटरनेट कनेक्शन\n• इमेज अपलोडसाठी पुरेसे डिव्हाइस स्टोरेज\n• थेट कॅप्चरसाठी वेबकॅम किंवा कॅमेरा (ब्राउझर सपोर्टवर अवलंबून)

source: First Time Setup
hi: पहली बार सेटअप
kn: ಮೊದಲ ಬಾರಿಯ ಸೆಟಪ್
mr: प्रथम वेळ सेटअप

source: 1. Ensure your browser is up-to-date.\n2. No specific software installation is required for the web app.\n3. Make sure you have a stable internet connection.
hi: 1. सुनिश्चित करें कि आपका ब्राउज़र अप-टू-डेट है।\n2. वेब ऐप के लिए किसी विशिष्ट सॉफ़्टवेयर इंस्टॉलेशन की आवश्यकता नहीं है।\n3. सुनिश्चित करें कि आपके पास एक स्थिर इंटरनेट कनेक्शन है।
kn: 1. ನಿಮ್ಮ ಬ್ರೌಸರ್ ನವೀಕೃತವಾಗಿದೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.\n2. ವೆಬ್ ಅಪ್ಲಿಕೇಶನ್‌ಗೆ ಯಾವುದೇ ನಿರ್ದಿಷ್ಟ ಸಾಫ್ಟ್‌ವೇರ್ ಸ್ಥಾಪನೆಯ ಅಗತ್ಯವಿಲ್ಲ.\n3. ನೀವು ಸ್ಥಿರವಾದ ಇಂಟರ್ನೆಟ್ ಸಂಪರ್ಕವನ್ನು ಹೊಂದಿರುವಿರಾ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.
mr: 1. तुमचा ब्राउझर अप-टू-डेट असल्याची खात्री करा.\n2. वेब अॅपसाठी कोणत्याही विशिष्ट सॉफ्टवेअर इन्स्टॉलेशनची आवश्यकता नाही.\n3. तुमच्याकडे स्थिर इंटरनेट कनेक्शन असल्याची खात्री करा.

source: Image Capture Guidelines
hi: छवि कैप्चर दिशानिर्देश
kn: ಚಿತ್ರ ಸೆರೆಹಿಡಿಯುವ ಮಾರ್ಗಸೂಚಿಗಳು
mr: इमेज कॅप्चर मार्गदर्शक तत्त्वे

source: Optimal Image Quality
hi: इष्टतम छवि गुणवत्ता
kn: ಸೂಕ್ತವಾದ ಚಿತ್ರ ಗುಣಮಟ್ಟ
mr: इष्टतम इमेज गुणवत्ता

source: • Capture in well-lit conditions\n• Focus on the leaf surface\n• Include both healthy and affected areas\n• Avoid shadows and glare
hi: • अच्छी रोशनी वाली स्थितियों में कैप्चर करें\n• पत्ती की सतह पर ध्यान दें\n• स्वस्थ और प्रभावित दोनों क्षेत्रों को शामिल करें\n• परछाई और चमक से बचें
kn: • ಚೆನ್ನಾಗಿ ಬೆಳಗಿದ ಪರಿಸ್ಥಿತಿಗಳಲ್ಲಿ ಸೆರೆಹಿಡಿಯಿರಿ\n• ಎಲೆಯ ಮೇಲ್ಮೈಯಲ್ಲಿ ಗಮನಹರಿಸಿ\n• ಆರೋಗ್ಯಕರ ಮತ್ತು ಪೀಡಿತ ಪ್ರದೇಶಗಳನ್ನು ಸೇರಿಸಿ\n• ನೆರಳುಗಳು ಮತ್ತು ಪ್ರಜ್ವಲಿಸುವಿಕೆಯನ್ನು ತಪ್ಪಿಸಿ
mr: • चांगल्या प्रकाशात फोटो घ्या\n• पानांच्या पृष्ठभागावर फोकस करा\n• निरोगी आणि प्रभावित दोन्ही क्षेत्रे समाविष्ट करा\n• सावल्या आणि चमक टाळा

source: Recommended Practices
hi: अनुशंसित प्रथाएं
kn: ಶಿಫಾರಸು ಮಾಡಲಾದ ಅಭ್ಯಾಸಗಳು
mr: शिफारस केलेल्या पद्धती

source: - Place leaf on neutral background\n- Include scale reference if possible\n- Capture multiple angles for severe cases
hi: - पत्ती को तटस्थ पृष्ठभूमि पर रखें\n- यदि संभव हो तो स्केल संदर्भ शामिल करें\n- गंभीर मामलों के लिए कई कोणों से कैप्चर करें
kn: - ಎಲೆಯನ್ನು ತಟಸ್ಥ ಹಿನ್ನೆಲೆಯಲ್ಲಿ ಇರಿಸಿ\n- ಸಾಧ್ಯವಾದರೆ ಸ್ಕೇಲ್ ಉಲ್ಲೇಖವನ್ನು ಸೇರಿಸಿ\n- ತೀವ್ರತರವಾದ ಪ್ರಕರಣಗಳಿಗೆ ಅನೇಕ ಕೋನಗಳನ್ನು ಸೆರೆಹಿಡಿಯಿರಿ
mr: - पान तटस्थ पार्श्वभूमीवर ठेवा\n- शक्य असल्यास स्केल संदर्भ समाविष्ट करा\n- गंभीर प्रकरणांसाठी अनेक कोनातून फोटो घ्या

source: Common Mistakes
hi: सामान्य गलतियाँ
kn: ಸಾಮಾನ್ಯ ತಪ್ಪುಗಳು
mr: सामान्य चुका

source: × Blurry or out-of-focus images\n× Images with multiple leaves\n× Extreme close-ups without context\n× Poor lighting conditions
hi: × धुंधली या आउट-ऑफ-फोकस छवियां\n× कई पत्तियों वाली छवियां\n× संदर्भ के बिना अत्यधिक क्लोज़-अप\n× खराब रोशनी की स्थिति
kn: × ಮಸುಕಾದ ಅಥವಾ ಗಮನಹರಿಸದ ಚಿತ್ರಗಳು\n× ಅನೇಕ ಎಲೆಗಳನ್ನು ಹೊಂದಿರುವ ಚಿತ್ರಗಳು\n× ಸಂದರ್ಭವಿಲ್ಲದೆ ವಿಪರೀತ ಕ್ಲೋಸ್-ಅಪ್‌ಗಳು\n× ಕಳಪೆ ಬೆಳಕಿನ ಪರಿಸ್ಥಿತಿಗಳು
mr: × अस्पष्ट किंवा आउट-ऑफ-फोकस प्रतिमा\n× एकाधिक पाने असलेल्या प्रतिमा\n× संदर्भाशिवाय अत्यंत क्लोज-अप\n× खराब प्रकाश स्थिती

source: Diagnosis Process
hi: निदान प्रक्रिया
kn: ರೋಗನಿರ್ಣಯ ಪ್ರಕ್ರಿಯೆ
mr: निदान प्रक्रिया

source: Step-by-Step Guide
hi: चरण-दर-चरण गाइड
kn: ಹಂತ-ಹಂತದ ಮಾರ್ಗದರ್ಶಿ
mr: चरण-दर-चरण मार्गदर्शक

source: 1. Navigate to Diagnosis page.\n2. Upload an image or use your device camera.\n3. Adjust image using enhancement tools if needed.\n4. View the diagnosis results, including confidence score and details.\n5. Save or print the comprehensive report.
hi: 1. निदान पृष्ठ पर जाएं।\n2. एक छवि अपलोड करें या एक कैप्चर करने के लिए अपने डिवाइस के कैमरे का उपयोग करें।\n3. यदि आवश्यक हो तो संवर्धन टूल का उपयोग करके छवि को समायोजित करें।\n4. आत्मविश्वास स्कोर और विवरण सहित निदान परिणाम देखें।\n5. व्यापक रिपोर्ट सहेजें या प्रिंट करें।
kn: 1. ರೋಗನಿರ್ಣಯ ಪುಟಕ್ಕೆ ನ್ಯಾವಿಗೇಟ್ ಮಾಡಿ.\n2. ಚಿತ್ರವನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡಿ ಅಥವಾ ನಿಮ್ಮ ಸಾಧನದ ಕ್ಯಾಮೆರಾವನ್ನು ಬಳಸಿ.\n3. ಅಗತ್ಯವಿದ್ದರೆ ವರ್ಧನೆ ಪರಿಕರಗಳನ್ನು ಬಳಸಿಕೊಂಡು ಚಿತ್ರವನ್ನು ಹೊಂದಿಸಿ.\n4. ವಿಶ್ವಾಸಾರ್ಹ ಸ್ಕೋರ್ ಮತ್ತು ವಿವರಗಳನ್ನು ಒಳಗೊಂಡಂತೆ ರೋಗನಿರ್ಣಯದ ಫಲಿತಾಂಶಗಳನ್ನು ವೀಕ್ಷಿಸಿ.\n5. ಸಮಗ್ರ ವರದಿಯನ್ನು ಉಳಿಸಿ ಅಥವಾ ಮುದ್ರಿಸಿ.
mr: 1. निदान पृष्ठावर जा.\n2. इमेज अपलोड करा किंवा तुमच्या डिव्हाइसचा कॅमेरा वापरा.\n3. आवश्यक असल्यास सुधारणा साधने वापरून इमेज समायोजित करा.\n4. विश्वास स्कोअर आणि तपशीलांसह निदान परिणाम पहा.\n5. सर्वसमावेशक अहवाल जतन करा किंवा प्रिंट करा.

source: Understanding Results
hi: परिणाम समझना
kn: ಫಲಿತಾಂಶಗಳನ್ನು ಅರ್ಥಮಾಡಿಕೊಳ್ಳುವುದು
mr: परिणाम समजून घेणे

source: • Confidence scores indicate prediction reliability.\n• Multiple results may appear for similar diseases.\n• Low confidence suggests retaking the image with better quality.
hi: • आत्मविश्वास स्कोर भविष्यवाणी की विश्वसनीयता का संकेत देते हैं।\n• समान बीमारियों के लिए कई परिणाम दिखाई दे सकते हैं।\n• कम आत्मविश्वास बेहतर गुणवत्ता के साथ छवि को फिर से लेने का सुझाव देता है।
kn: • ವಿಶ್ವಾಸಾರ್ಹ ಅಂಕಗಳು ಭವಿಷ್ಯವಾಣಿಯ ವಿಶ್ವಾಸಾರ್ಹತೆಯನ್ನು ಸೂಚಿಸುತ್ತವೆ.\n• ಇದೇ ರೀತಿಯ ಕಾಯಿಲೆಗಳಿಗೆ ಬಹು ಫಲಿತಾಂಶಗಳು ಕಾಣಿಸಿಕೊಳ್ಳಬಹುದು.\n• ಕಡಿಮೆ ವಿಶ್ವಾಸವು ಉತ್ತಮ ಗುಣಮಟ್ಟದೊಂದಿಗೆ ಚಿತ್ರವನ್ನು ಹಿಂಪಡೆಯಲು ಸೂಚಿಸುತ್ತದೆ.
mr: • कॉन्फिडन्स स्कोअर अंदाजानुसार विश्वासार्हता दर्शवतात.\n• समान रोगांसाठी अनेक परिणाम दिसू शकतात.\n• कमी आत्मविश्वास चांगल्या गुणवत्तेसह इमेज पुन्हा घेण्यास सूचित करतो.

source: Troubleshooting Diagnosis
hi: निदान समस्या निवारण
kn: ರೋಗನಿರ್ಣಯ ದೋಷನಿವಾರಣೆ
mr: निदान समस्या निवारण

source: If you get poor results:\n- Try different image adjustments.\n- Capture a clearer image.\n- Ensure the image is of a single crop leaf.
hi: यदि आपको खराब परिणाम मिलते हैं:\n- विभिन्न छवि समायोजन का प्रयास करें।\n- एक स्पष्ट छवि कैप्चर करें।\n- सुनिश्चित करें कि छवि एक एकल फसल पत्ती की है।
kn: ನೀವು ಕಳಪೆ ಫಲಿತಾಂಶಗಳನ್ನು ಪಡೆದರೆ:\n- ವಿಭಿನ್ನ ಚಿತ್ರ ಹೊಂದಾಣಿಕೆಗಳನ್ನು ಪ್ರಯತ್ನಿಸಿ.\n- ಸ್ಪಷ್ಟವಾದ ಚಿತ್ರವನ್ನು ಸೆರೆಹಿಡಿಯಿರಿ.\n- ಚಿತ್ರವು ಒಂದೇ ಬೆಳೆ ಎಲೆಯದ್ದಾಗಿದೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.
mr: जर तुम्हाला खराब परिणाम मिळत असतील:\n- वेगवेगळ्या इमेज समायोजनांचा प्रयत्न करा.\n- अधिक स्पष्ट इमेज घ्या.\n- खात्री करा की इमेज एकाच पीक पानाची आहे.

source: Advanced Features
hi: उन्नत सुविधाएं
kn: ಸುಧಾರಿತ ವೈಶಿಷ್ಟ್ಯಗಳು
mr: प्रगत वैशिष्ट्ये

source: • Brightness/Contrast adjustment\n• Color saturation controls\n• Sharpening filters\n• Cropping functionality\n• Auto-contrast and grayscale presets
hi: • चमक/कंट्रास्ट समायोजन\n• रंग संतृप्ति नियंत्रण\n• शार्पनिंग फिल्टर\n• क्रॉपिंग कार्यक्षमता\n• ऑटो-कंट्रास्ट और ग्रेस्केल प्रीसेट
kn: • ಬ್ರೈಟ್‌ನೆಸ್/ಕಾಂಟ್ರಾಸ್ಟ್ ಹೊಂದಾಣಿಕೆ\n• ಬಣ್ಣ ಸ್ಯಾಚುರೇಶನ್ ನಿಯಂತ್ರಣಗಳು\n• ಶಾರ್ಪನಿಂಗ್ ಫಿಲ್ಟರ್‌ಗಳು\n• ಕ್ರಾಪಿಂಗ್ ಕಾರ್ಯಕ್ಷಮತೆ\n• ಆಟೋ-ಕಾಂಟ್ರಾಸ್ಟ್ ಮತ್ತು ಗ್ರೇಸ್ಕೇಲ್ ಪೂರ್ವನಿಗದಿಗಳು
mr: • ब्राइटनेस/कॉन्ट्रास्ट समायोजन\n• कलर सॅच्युरेशन नियंत्रणे\n• शार्पनिंग फिल्टर\n• क्रॉपिंग कार्यक्षमता\n• ऑटो-कॉन्ट्रास्ट आणि ग्रेस्केल प्रीसेट

source: History Management
hi: इतिहास प्रबंधन
kn: ಇತಿಹಾಸ ನಿರ್ವಹಣೆ
mr: इतिहास व्यवस्थापन

source: • View past diagnoses.\n• Filter by date/crop type.\n• Export complete history to JSON.\n• Import history from JSON.\n• Re-diagnose or view image from history.
hi: • पिछले निदान देखें।\n• दिनांक/फसल प्रकार द्वारा फ़िल्टर करें।\n• JSON में पूरा इतिहास निर्यात करें।\n• JSON से इतिहास आयात करें।\n• पुन: निदान करें या इतिहास से छवि देखें।
kn: • ಹಿಂದಿನ ರೋಗನಿರ್ಣಯಗಳನ್ನು ವೀಕ್ಷಿಸಿ.\n• ದಿನಾಂಕ/ಬೆಳೆ ಪ್ರಕಾರದ ಮೂಲಕ ಫಿಲ್ಟರ್ ಮಾಡಿ.\n• ಸಂಪೂರ್ಣ ಇತಿಹಾಸವನ್ನು JSON ಗೆ ರಫ್ತು ಮಾಡಿ.\n• JSON ನಿಂದ ಇತಿಹಾಸವನ್ನು ಆಮದು ಮಾಡಿಕೊಳ್ಳಿ.\n• ಮರು-ರೋಗನಿರ್ಣಯ ಮಾಡಿ ಅಥವಾ ಇತಿಹಾಸದಿಂದ ಚಿತ್ರವನ್ನು ವೀಕ್ಷಿಸಿ.
mr: • मागील निदान पहा.\n• तारीख/पीक प्रकारानुसार फिल्टर करा.\n• संपूर्ण इतिहास JSON मध्ये निर्यात करा.\n• JSON मधून इतिहास आयात करा.\n• पुन्हा निदान करा किंवा इतिहासातून इमेज पहा.

source: Feedback System
hi: प्रतिक्रिया प्रणाली
kn: ಪ್ರತಿಕ್ರಿಯೆ ವ್ಯವಸ್ಥೆ
mr: प्रतिक्रिया प्रणाली

source: • Submit suggestions, bug reports, or feature requests.\n• Optionally attach screenshots.\n• Rate your overall experience.
hi: • सुझाव, बग रिपोर्ट, या सुविधा अनुरोध जमा करें।\n• वैकल्पिक रूप से स्क्रीनशॉट संलग्न करें।\n• अपने समग्र अनुभव को रेट करें।
kn: • ಸಲಹೆಗಳು, ದೋಷ ವರದಿಗಳು ಅಥವಾ ವೈಶಿಷ್ಟ್ಯದ ವಿನಂತಿಗಳನ್ನು ಸಲ್ಲಿಸಿ.\n• ಐಚ್ಛಿಕವಾಗಿ ಸ್ಕ್ರೀನ್‌ಶಾಟ್‌ಗಳನ್ನು ಲಗತ್ತಿಸಿ.\n• ನಿಮ್ಮ ಒಟ್ಟಾರೆ ಅನುಭವವನ್ನು ರೇಟ್ ಮಾಡಿ.
mr: • सूचना, बग रिपोर्ट किंवा वैशिष्ट्य विनंत्या सबमिट करा.\n• वैकल्पिकरित्या स्क्रीनशॉट जोडा.\n• तुमच्या एकूण अनुभवाला रेट करा.

source: Troubleshooting
hi: समस्या निवारण
kn: ದೋಷನಿವಾರಣೆ
mr: समस्या निवारण

source: Common Issues
hi: सामान्य मुद्दे
kn: ಸಾಮಾನ್ಯ ಸಮಸ್ಯೆಗಳು
mr: सामान्य समस्या

source: • Image upload failed: Check file size and format.\n• Slow performance: Ensure a stable internet connection; large images take longer.\n• Incorrect results: Verify image quality and ensure it is a single crop leaf.
hi: • छवि अपलोड विफल: फ़ाइल आकार और प्रारूप की जाँच करें।\n• धीमा प्रदर्शन: एक स्थिर इंटरनेट कनेक्शन सुनिश्चित करें; बड़ी छवियों में अधिक समय लगता है।\n• गलत परिणाम: छवि गुणवत्ता सत्यापित करें और सुनिश्चित करें कि यह एक एकल फसल पत्ती है।
kn: • ಚಿತ್ರ ಅಪ್‌ಲೋಡ್ ವಿಫಲವಾಗಿದೆ: ಫೈಲ್ ಗಾತ್ರ ಮತ್ತು ಸ್ವರೂಪವನ್ನು ಪರಿಶೀಲಿಸಿ.\n• ನಿಧಾನ ಕಾರ್ಯಕ್ಷಮತೆ: ಸ್ಥಿರವಾದ ಇಂಟರ್ನೆಟ್ ಸಂಪರ್ಕವನ್ನು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ; ದೊಡ್ಡ ಚಿತ್ರಗಳು ಹೆಚ್ಚು ಸಮಯ ತೆಗೆದುಕೊಳ್ಳುತ್ತವೆ.\n• ತಪ್ಪಾದ ಫಲಿತಾಂಶಗಳು: ಚಿತ್ರದ ಗುಣಮಟ್ಟವನ್ನು ಪರಿಶೀಲಿಸಿ ಮತ್ತು ಅದು ಒಂದೇ ಬೆಳೆ ಎಲೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.
mr: • इमेज अपलोड अयशस्वी: फाइल आकार आणि फॉरमॅट तपासा.\n• स्लो परफॉर्मन्स: स्थिर इंटरनेट कनेक्शन असल्याची खात्री करा; मोठ्या प्रतिमांना जास्त वेळ लागतो.\n• चुकीचे परिणाम: इमेज गुणवत्ता सत्यापित करा आणि खात्री करा की ती एकाच पीक पानाची आहे.

source: Error Messages
hi: त्रुटि संदेश
kn: ದೋಷ ಸಂದೇಶಗಳು
mr: त्रुटी संदेश

source: - Invalid image: Try a different format (JPG, PNG, BMP).\n- Low confidence: Retake image with better lighting/focus.\n- Server error: Contact support or try again later.
hi: - अमान्य छवि: एक अलग प्रारूप (JPG, PNG, BMP) का प्रयास करें।\n- कम आत्मविश्वास: बेहतर रोशनी/फोकस के साथ छवि को फिर से लें।\n- सर्वर त्रुटि: समर्थन से संपर्क करें या बाद में पुनः प्रयास करें।
kn: - ಅಮಾನ್ಯ ಚಿತ್ರ: ಬೇರೆ ಸ್ವರೂಪವನ್ನು ಪ್ರಯತ್ನಿಸಿ (JPG, PNG, BMP).\n- ಕಡಿಮೆ ವಿಶ್ವಾಸ: ಉತ್ತಮ ಬೆಳಕು/ಫೋಕಸ್‌ನೊಂದಿಗೆ ಚಿತ್ರವನ್ನು ಮರುಪಡೆಯಿರಿ.\n- ಸರ್ವರ್ ದೋಷ: ಬೆಂಬಲವನ್ನು ಸಂಪರ್ಕಿಸಿ ಅಥವಾ ನಂತರ ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ.
mr: - अमान्य इमेज: वेगळे फॉरमॅट (JPG, PNG, BMP) वापरून पहा.\n- कमी आत्मविश्वास: चांगल्या लाइटिंग/फोकससह इमेज पुन्हा घ्या.\n- सर्व्हर त्रुटी: समर्थनाशी संपर्क साधा किंवा नंतर पुन्हा प्रयत्न करा.

source: FAQ
hi: अक्सर पूछे जाने वाले प्रश्न
kn: ಪದೇ ಪದೇ ಕೇಳಲಾಗುವ ಪ್ರಶ್ನೆಗಳು (FAQ)
mr: वारंवार विचारले जाणारे प्रश्न (FAQ)
