Repository: ayushchoubey62/Crop-Detection
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: hi, kn, mr

source: Q: Can I use this for any crop?\nA: Currently supports 15 major crops (see full list in About page).\n\nQ: How accurate are the results?\nA: Accuracy depends on image quality and model training data. Average accuracy is high in controlled conditions.
hi: प्रश्न: क्या मैं इसका उपयोग किसी भी फसल के लिए कर सकता हूं?\nउत्तर: वर्तमान में 15 प्रमुख फसलों का समर्थन करता है (हमारे बारे में पृष्ठ में पूरी सूची देखें)।\n\nप्रश्न: परिणाम कितने सटीक हैं?\nउत्तर: सटीकता छवि गुणवत्ता और मॉडल प्रशिक्षण डेटा पर निर्भर करती है। नियंत्रित स्थितियों में औसत सटीकता अधिक है।
kn: ಪ್ರ: ನಾನು ಇದನ್ನು ಯಾವುದೇ ಬೆಳೆಗೆ ಬಳಸಬಹುದೇ?\nಉ: ಪ್ರಸ್ತುತ 15 ಪ್ರಮುಖ ಬೆಳೆಗಳನ್ನು ಬೆಂಬಲಿಸುತ್ತದೆ (ನಮ್ಮ ಬಗ್ಗೆ ಪುಟದಲ್ಲಿ ಸಂಪೂರ್ಣ ಪಟ್ಟಿಯನ್ನು ನೋಡಿ).\n\nಪ್ರ: ಫಲಿತಾಂಶಗಳು ಎಷ್ಟು ನಿಖರವಾಗಿವೆ?\nಉ: ನಿಖರತೆಯು ಚಿತ್ರದ ಗುಣಮಟ್ಟ ಮತ್ತು ಮಾದರಿ ತರಬೇತಿ ಡೇಟಾವನ್ನು ಅವಲಂಬಿಸಿರುತ್ತದೆ. ನಿಯಂತ್ರಿತ ಪರಿಸ್ಥಿತಿಗಳಲ್ಲಿ ಸರಾಸರಿ ನಿಖರತೆ ಹೆಚ್ಚು.
mr: प्र: मी हे कोणत्याही पिकासाठी वापरू शकतो का?\nउ: सध्या 15 प्रमुख पिकांना सपोर्ट करते (आमच्याबद्दल पृष्ठावर पूर्ण यादी पहा).\n\nप्र: परिणाम किती अचूक आहेत?\nउ: अचूकता इमेज गुणवत्ता आणि मॉडेल ट्रेनिंग डेटावर अवलंबून असते. नियंत्रित परिस्थितीत सरासरी अचूकता उच्च आहे.

source: Support & Resources
hi: सहायता और संसाधन
kn: ಬೆಂಬಲ ಮತ್ತು ಸಂಪನ್ಮೂಲಗಳು
mr: समर्थन आणि संसाधने

source: Contact Information
hi: संपर्क जानकारी
kn: ಸಂಪರ್ಕ ಮಾಹಿತಿ
mr: संपर्क माहिती

source: • Email: support@cropdiagnosis.com (placeholder)\n• For real support, use the Feedback page or check our official website (if available).
hi: • ईमेल: support@cropdiagnosis.com (प्लेसहोल्डर)\n• वास्तविक समर्थन के लिए, प्रतिक्रिया पृष्ठ का उपयोग करें या हमारी आधिकारिक वेबसाइट देखें (यदि उपलब्ध हो)।
kn: • ಇಮೇಲ್: support@cropdiagnosis.com (ಪ್ಲೇಸ್‌ಹೋಲ್ಡರ್)\n• ನಿಜವಾದ ಬೆಂಬಲಕ್ಕಾಗಿ, ಪ್ರತಿಕ್ರಿಯೆ ಪುಟವನ್ನು ಬಳಸಿ ಅಥವಾ ನಮ್ಮ ಅಧಿಕೃತ ವೆಬ್‌ಸೈಟ್ ಪರಿಶೀಲಿಸಿ (ಲಭ್ಯವಿದ್ದರೆ).
mr: • ईमेल: support@cropdiagnosis.com (प्लेसहोल्डर)\n• वास्तविक समर्थनासाठी, फीडबॅक पृष्ठ वापरा किंवा आमची अधिकृत वेबसाइट तपासा (उपलब्ध असल्यास).

source: Additional Resources
hi: अतिरिक्त संसाधन
kn: ಹೆಚ್ಚುವರಿ ಸಂಪನ್ಮೂಲಗಳು
mr: अतिरिक्त संसाधने

source: - Video tutorials (if available)\n- Community forums (if available)\n- External agricultural resources.
hi: - वीडियो ट्यूटोरियल (यदि उपलब्ध हो)\n- सामुदायिक मंच (यदि उपलब्ध हो)\n- बाहरी कृषि संसाधन।
kn: - ವೀಡಿಯೊ ಟ್ಯುಟೋರಿಯಲ್‌ಗಳು (ಲಭ್ಯವಿದ್ದರೆ)\n- ಸಮುದಾಯ ವೇದಿಕೆಗಳು (ಲಭ್ಯವಿದ್ದರೆ)\n- ಬಾಹ್ಯ ಕೃಷಿ ಸಂಪನ್ಮೂಲಗಳು.
mr: - व्हिडिओ ट्यूटोरियल्स (उपलब्ध असल्यास)\n- समुदाय मंच (उपलब्ध असल्यास)\n- बाह्य कृषी संसाधने.

source: We value your input! Please report any issues or suggestions through the dedicated Feedback page in the navigation menu.
hi: हम आपकी राय को महत्व देते हैं! कृपया नेविगेशन मेनू में समर्पित प्रतिक्रिया पृष्ठ के माध्यम से किसी भी मुद्दे या सुझाव की रिपोर्ट करें।
kn: ನಿಮ್ಮ ಪ್ರತಿಕ್ರಿಯೆಯನ್ನು ನಾವು ಗೌರವಿಸುತ್ತೇವೆ! ನ್ಯಾವಿಗೇಷನ್ ಮೆನುವಿನಲ್ಲಿರುವ ಮೀಸಲಾದ ಪ್ರತಿಕ್ರಿಯೆ ಪುಟದ ಮೂಲಕ ದಯವಿಟ್ಟು ಯಾವುದೇ ಸಮಸ್ಯೆಗಳು ಅಥವಾ ಸಲಹೆಗಳನ್ನು ವರದಿ ಮಾಡಿ.
mr: आम्ही तुमच्या इनपुटला महत्त्व देतो! कृपया नेव्हिगेशन मेनूमधील समर्पित फीडबॅक पृष्ठाद्वारे कोणत्याही समस्या किंवा सूचनांची तक्रार करा.

source: Diagnosis History
hi: निदान इतिहास
kn: ರೋಗನಿರ್ಣಯ ಇತಿಹಾಸ
mr: निदान इतिहास

source: Controls
hi: नियंत्रण
kn: ನಿಯಂತ್ರಣಗಳು
mr: नियंत्रणे

source: Sort by:
hi: इसके द्वारा क्रमबद्ध करें:
kn: ಇದರ ಮೂಲಕ ವಿಂಗಡಿಸಿ:
mr: यानुसार क्रमवारी लावा:

source: Most Recent
hi: सबसे हालिया
kn: ತೀರಾ ಇತ್ತೀಚಿನದು
mr: सर्वात अलीकडील

source: Oldest First
hi: सबसे पुराना पहले
kn: ಹಳೆಯದು ಮೊದಲು
mr: जुने प्रथम

source: Highest Confidence
hi: उच्चतम आत्मविश्वास
kn: ಅತ್ಯುನ್ನತ ವಿಶ್ವಾಸ
mr: सर्वोच्च आत्मविश्वास

source: Lowest Confidence
hi: न्यूनतम आत्मविश्वास
kn: ಕಡಿಮೆ ವಿಶ್ವಾಸ
mr: सर्वात कमी आत्मविश्वास

source: Filter by crop:
hi: फसल द्वारा फ़िल्टर करें:
kn: ಬೆಳೆಯ ಮೂಲಕ ಫಿಲ್ಟರ್ ಮಾಡಿ:
mr: पिकानुसार फिल्टर करा:

source: All Crops
hi: सभी फसलें
kn: ಎಲ್ಲಾ ಬೆಳೆಗಳು
mr: सर्व पिके

source: Recent Diagnoses
hi: हाल के निदान
kn: ಇತ್ತೀಚಿನ ರೋಗನಿರ್ಣಯಗಳು
mr: अलीकडील निदान

source: Loading history...
hi: इतिहास लोड हो रहा है...
kn: ಇತಿಹಾಸ ಲೋಡ್ ಆಗುತ್ತಿದೆ...
mr: इतिहास लोड होत आहे...

source: Diagnosis Details
hi: निदान विवरण
kn: ರೋಗನಿರ್ಣಯ ವಿವರಗಳು
mr: निदान तपशील

source: Select an item to view details
hi: विवरण देखने के लिए एक आइटम चुनें
kn: ವಿವರಗಳನ್ನು ವೀಕ್ಷಿಸಲು ಐಟಂ ಆಯ್ಕೆಮಾಡಿ
mr: तपशील पाहण्यासाठी आयटम निवडा

source: View Full Image
hi: पूरी छवि देखें
kn: ಪೂರ್ಣ ಚಿತ್ರವನ್ನು ವೀಕ್ಷಿಸಿ
mr: पूर्ण इमेज पहा

source: Re-diagnose
hi: पुन: निदान करें
kn: ಮರು-ರೋಗನಿರ್ಣಯ
mr: पुन्हा निदान करा

source: Delete Selected
hi: चयनित हटाएं
kn: ಆಯ್ಕೆಮಾಡಿದನ್ನು ಅಳಿಸಿ
mr: निवडलेले हटवा

source: Export All History
hi: सभी इतिहास निर्यात करें
kn: ಎಲ್ಲಾ ಇತಿಹಾಸವನ್ನು ರಫ್ತು ಮಾಡಿ
mr: सर्व इतिहास निर्यात करा

source: Import History
hi: इतिहास आयात करें
kn: ಇತಿಹಾಸವನ್ನು ಆಮದು ಮಾಡಿಕೊಳ್ಳಿ
mr: इतिहास आयात करा

source: Clear All History
hi: सभी इतिहास साफ़ करें
kn: ಎಲ್ಲಾ ಇತಿಹಾಸವನ್ನು ತೆರವುಗೊಳಿಸಿ
mr: सर्व इतिहास साफ करा

source: AI-powered detection & Real-time Risk Analysis
hi: एआई-संचालित पहचान और रीयल-टाइम जोखिम विश्लेषण
kn: AI-ಚಾಲಿತ ಪತ್ತೆ ಮತ್ತು ನೈಜ-ಸಮಯದ ಅಪಾಯದ ವಿಶ್ಲೇಷಣೆ
mr: एआय-आधारित ओळख आणि रिअल-टाइम जोखीम विश्लेषण

source: Diagnose Crop
hi: फसल का निदान करें
kn: ಬೆಳೆ ರೋಗ ಪತ್ತೆ ಮಾಡಿ
mr: पिकाचे निदान करा

source: View History
hi: इतिहास देखें
kn: ಇತಿಹಾಸವನ್ನು ವೀಕ್ಷಿಸಿ
mr: इतिहास पहा

source: Community Experts
hi: सामुदायिक विशेषज्ञ
kn: ಸಮುದಾಯ ತಜ್ಞರು
mr: समुदाय तज्ञ

source: Govt Schemes
hi: सरकारी योजनाएं
kn: ಸರ್ಕಾರಿ ಯೋಜನೆಗಳು
mr: सरकारी योजना

source: Help & Guide
hi: सहायता और गाइड
kn: ಸಹಾಯ ಮತ್ತು ಮಾರ್ಗದರ್ಶಿ
mr: मदत आणि मार्गदर्शक

source: Live Disease Forecast
hi: लाइव रोग पूर्वानुमान
kn: ಲೈವ್ ರೋಗ ಮುನ್ಸೂಚನೆ
mr: थेट रोग अंदाज

source: Enter City (e.g. Pune)
hi: शहर दर्ज करें (जैसे पुणे)
kn: ನಗರವನ್ನು ನಮೂದಿಸಿ (ಉದಾ. ಪುಣೆ)
mr: शहर प्रविष्ट करा (उदा. पुणे)

source: Check
hi: जाँच करें
kn: ಪರಿಶೀಲಿಸಿ
mr: तपासा

source: Risk
hi: जोखिम
kn: ಅಪಾಯ
mr: जोखीम

source: Grow smarter • Stay healthier
hi: होशियार बनें • स्वस्थ रहें
kn: ಚುರುಕಾಗಿ ಬೆಳೆಯಿರಿ • ಆರೋಗ್ಯವಾಗಿರಿ
mr: हुशार बना • निरोगी राहा

source: Please enter a city!
hi: कृपया एक शहर दर्ज करें!
kn: ದಯವಿಟ್ಟು ನಗರವನ್ನು ನಮೂದಿಸಿ!
mr: कृपया शहर प्रविष्ट करा!

source: Failed to connect to weather service.
hi: मौसम सेवा से जुड़ने में विफल।
kn: ಹವಾಮಾನ ಸೇವೆಗೆ ಸಂಪರ್ಕಿಸಲು ವಿಫಲವಾಗಿದೆ.
mr: हवामान सेवेशी कनेक्ट करण्यात अयशस्वी.

source: Government Schemes & Subsidies
hi: सरकारी योजनाएं और सब्सिडी
kn: ಸರ್ಕಾರಿ ಯೋಜನೆಗಳು ಮತ್ತು ಸಬ್ಸಿಡಿಗಳು
mr: शासकीय योजना आणि सबसिडी

source: Find financial aid, insurance, and subsidies tailored for you.
hi: अपने लिए वित्तीय सहायता, बीमा और सब्सिडी खोजें।
kn: ನಿಮಗಾಗಿ ಆರ್ಥಿಕ ಸಹಾಯ, ವಿಮೆ ಮತ್ತು ಸಬ್ಸಿಡಿಗಳನ್ನು ಹುಡುಕಿ.
mr: तुमच्यासाठी आर्थिक मदत, विमा आणि सबसिडी शोधा.

source: State
hi: राज्य
kn: ರಾಜ್ಯ
mr: राज्य

source: All India
hi: अखिल भारतीय
kn: ಅಖಿಲ ಭಾರತ
mr: अखिल भारतीय

source: Andhra Pradesh
hi: आंध्र प्रदेश
kn: ಆಂಧ್ರಪ್ರದೇಶ
mr: आंध्र प्रदेश

source: Arunachal Pradesh
hi: अरुणाचल प्रदेश
kn: ಅರುಣಾಚಲ ಪ್ರದೇಶ
mr: अरुणाचल प्रदेश

source: Assam
hi: असम
kn: ಅಸ್ಸಾಂ
mr: आसाम

source: Bihar
hi: बिहार
kn: ಬಿಹಾರ
mr: बिहार

source: Chhattisgarh
hi: छत्तीसगढ़
kn: ಛತ್ತೀಸ್‌ಗಢ
mr: छत्तीसगड

source: Goa
hi: गोवा
kn: ಗೋವಾ
mr: गोवा

source: Gujarat
hi: गुजरात
kn: ಗುಜರಾತ್
mr: गुजरात

source: Haryana
hi: हरियाणा
kn: ಹರಿಯಾಣ
mr: हरियाणा

source: Himachal Pradesh
hi: हिमाचल प्रदेश
kn: ಹಿಮಾಚಲ ಪ್ರದೇಶ
mr: हिमाचल प्रदेश

source: Jharkhand
hi: झारखंड
kn: ಜಾರ್ಖಂಡ್
mr: झारखंड

source: Karnataka
hi: कर्नाटक
kn: ಕರ್ನಾಟಕ
mr: कर्नाटक

source: Kerala
hi: केरल
kn: ಕೇರಳ
mr: केरळ

source: Madhya Pradesh
hi: मध्य प्रदेश
kn: ಮಧ್ಯಪ್ರದೇಶ
mr: मध्य प्रदेश

source: Maharashtra
hi: महाराष्ट्र
kn: ಮಹಾರಾಷ್ಟ್ರ
mr: महाराष्ट्र

source: Manipur
hi: मणिपुर
kn: ಮಣಿಪುರ
mr: मणिपूर

source: Meghalaya
hi: मेघालय
kn: ಮೇಘಾಲಯ
mr: मेघालय

source: Mizoram
hi: मिजोरम
kn: ಮಿಜೋರಾಂ
mr: मिझोराम

source: Nagaland
hi: नागालैंड
kn: ನಾಗಾಲ್ಯಾಂಡ್
mr: नागालँड

source: Odisha
hi: ओडिशा
kn: ಒಡಿಶಾ
mr: ओडिशा

source: Punjab
hi: पंजाब
kn: ಪಂಜಾಬ್
mr: पंजाब

source: Rajasthan
hi: राजस्थान
kn: ರಾಜಸ್ಥಾನ
mr: राजस्थान

source: Sikkim
hi: सिक्किम
kn: ಸಿಕ್ಕಿಂ
mr: सिक्किम

source: Tamil Nadu
hi: तमिलनाडु
kn: ತಮಿಳುನಾಡು
mr: तामिळनाडू

source: Telangana
hi: तेलंगाना
kn: ತೆಲಂಗಾಣ
mr: तेलंगणा

source: Tripura
hi: त्रिपुरा
kn: ತ್ರಿಪುರಾ
mr: त्रिपुरा

source: Uttar Pradesh
hi: उत्तर प्रदेश
kn: ಉತ್ತರ ಪ್ರದೇಶ
mr: उत्तर प्रदेश

source: Uttarakhand
hi: उत्तराखंड
kn: ಉತ್ತರಾಖಂಡ್
mr: उत्तराखंड

source: West Bengal
hi: पश्चिम बंगाल
kn: ಪಶ್ಚಿಮ ಬಂಗಾಳ
mr: पश्चिम बंगाल

source: Andaman & Nicobar Islands
hi: अंडमान और निकोबार द्वीप समूह
kn: ಅಂಡಮಾನ್ ಮತ್ತು ನಿಕೋಬಾರ್ ದ್ವೀಪಗಳು
mr: अंदमान आणि निकोबार बेटे

source: Chandigarh
hi: चंडीगढ़
kn: ಚಂಡೀಗಢ
mr: चंदिगढ

source: Dadra & Nagar Haveli and Daman & Diu
hi: दादरा और नगर हवेली और दमन और दीव
kn: ದಾದ್ರಾ ಮತ್ತು ನಗರ ಹವೇಲಿ ಮತ್ತು ದಮನ್ ಮತ್ತು ದಿಯು
mr: दादरा आणि नगर हवेली आणि दमण आणि दीव

source: Delhi
hi: दिल्ली
kn: ದೆಹಲಿ
mr: दिल्ली

source: Jammu & Kashmir
hi: जम्मू और कश्मीर
kn: ಜಮ್ಮು ಮತ್ತು ಕಾಶ್ಮೀರ
mr: जम्मू आणि काश्मीर

source: Ladakh
hi: लद्दाख
kn: ಲಡಾಖ್
mr: लडाख

source: Lakshadweep
hi: लक्षद्वीप
kn: ಲಕ್ಷದ್ವೀಪ
mr: लक्षद्वीप

source: Puducherry
hi: पुडुचेरी
kn: ಪುದುಚೇರಿ
mr: पुदुचेरी

source: Crop Type
hi: फसल का प्रकार
kn: ಬೆಳೆ ಪ್ರಕಾರ
mr: पीक प्रकार

source: Apple
hi: सेब
kn: ಸೇಬು
mr: सफरचंद

source: Corn (Maize)
hi: मक्का
kn: ಜೋಳ (ಮೆಕ್ಕೆ ಜೋಳ)
mr: मका

source: Grape
hi: अंगूर
kn: ದ್ರಾಕ್ಷಿ
mr: द्राक्ष

source: Potato
hi: आलू
kn: ಆಲೂಗಡ್ಡೆ
mr: बटाटा

source: Tomato
hi: टमाटर
kn: ಟೊಮೆಟೊ
mr: टोमॅटो

source: Soybean
hi: सोयाबीन
kn: ಸೋಯಾಬೀನ್
mr: सोयाबीन

source: Orange
hi: संतरा
kn: ಕಿತ್ತಳೆ
mr: संत्रा

source: Strawberry
hi: स्ट्रॉबेरी
kn: ಸ್ಟ್ರಾಬೆರಿ
mr: स्ट्रॉबेरी

source: Find Schemes
hi: योजनाएं खोजें
kn: ಯೋಜನೆಗಳನ್ನು ಹುಡುಕಿ
mr: योजना शोधा

source: Expired
hi: समाप्त
kn: ಅವಧಿ ಮುಗಿದಿದೆ
mr: कालबाह्य

source: Ending Soon
hi: जल्द समाप्त हो रहा है
kn: ಶೀಘ್ರದಲ್ಲೇ ಮುಗಿಯಲಿದೆ
mr: लवकरच संपत आहे

source: Active
hi: सक्रिय
kn: ಸಕ್ರಿಯ
mr: सक्रिय

source: Benefit
hi: लाभ
kn: ಪ್ರಯೋಜನ
mr: फायदा

source: Deadline
hi: अंतिम तिथि
kn: ಗಡುವು
mr: अंतिम मुदत

source: Apply Now
hi: अभी आवेदन करें
kn: ಈಗ ಅನ್ವಯಿಸಿ
mr: आता अर्ज करा

source: No schemes found matching your filters.
hi: आपके फ़िल्टर से मेल खाने वाली कोई योजना नहीं मिली।
kn: ನಿಮ್ಮ ಫಿಲ್ಟರ್‌ಗಳಿಗೆ ಹೊಂದಿಕೆಯಾಗುವ ಯಾವುದೇ ಯೋಜನೆಗಳು ಕಂಡುಬಂದಿಲ್ಲ.
mr: तुमच्या फिल्टरशी जुळणाऱ्या कोणत्याही योजना आढळल्या नाहीत.

source: Try selecting "All" to see Global Schemes.
hi: वैश्विक योजनाएं देखने के लिए "सभी" का चयन करने का प्रयास करें।
kn: ಜಾಗತಿಕ ಯೋಜನೆಗಳನ್ನು ನೋಡಲು "ಎಲ್ಲಾ" ಆಯ್ಕೆ ಮಾಡಲು ಪ್ರಯತ್ನಿಸಿ.
mr: जागतिक योजना पाहण्यासाठी "सर्व" निवडण्याचा प्रयत्न करा.

source: Last Updated:
hi: अंतिम अपडेट:
kn: ಕೊನೆಯದಾಗಿ ನವೀಕರಿಸಲಾಗಿದೆ:
mr: शेवटचे अपडेट:

source: Acceptance of Terms
hi: शर्तों की स्वीकृति
kn: ನಿಯಮಗಳ ಅಂಗೀಕಾರ
mr: अटींची स्वीकृती

source: By accessing and using Crop Doctor AI, you accept and agree to be bound by the terms and provision of this agreement.
hi: क्रॉप डॉक्टर एआई तक पहुँचने और उपयोग करने से, आप इस समझौते के नियमों और प्रावधानों से बाध्य होने के लिए स्वीकार और सहमत होते हैं।
kn: ಕ್ರಾಪ್ ಡಾಕ್ಟರ್ ಎಐ ಅನ್ನು ಪ್ರವೇಶಿಸುವ ಮತ್ತು ಬಳಸುವ ಮೂಲಕ, ಈ ಒಪ್ಪಂದದ ನಿಯಮಗಳು ಮತ್ತು ನಿಬಂಧನೆಗಳಿಗೆ ಬದ್ಧರಾಗಿರಲು ನೀವು ಒಪ್ಪಿಕೊಳ್ಳುತ್ತೀರಿ.
mr: क्रॉप डॉक्टर एआय ऍक्सेस करून आणि वापरून, तुम्ही या कराराच्या अटी आणि तरतुदींना बांधील राहण्यास स्वीकारता आणि सहमत होता.

source: Educational Use Only (Disclaimer)
hi: केवल शैक्षिक उपयोग (अस्वीकरण)
kn: ಶೈಕ್ಷಣಿಕ ಬಳಕೆ ಮಾತ್ರ (ಹಕ್ಕು ನಿರಾಕರಣೆ)
mr: केवळ शैक्षणिक वापर (अस्वीकरण)

source: This is an AI-assisted diagnostic tool.
hi: यह एक एआई-सहायता प्राप्त निदान उपकरण है।
kn: ಇದು AI-ಸಹಾಯದ ರೋಗನಿರ್ಣಯ ಸಾಧನವಾಗಿದೆ.
mr: हे एआय-सहाय्यित निदान साधन आहे.

source: The results provided by Crop Doctor AI are for informational purposes only. While we strive for accuracy, this tool should not replace professional agricultural advice or lab testing. We are not liable for any crop loss or financial damage resulting from reliance on this tool.
hi: क्रॉप डॉक्टर एआई द्वारा प्रदान किए गए परिणाम केवल सूचनात्मक उद्देश्यों के लिए हैं। जबकि हम सटीकता के लिए प्रयास करते हैं, इस उपकरण को पेशेवर कृषि सलाह या लैब परीक्षण की जगह नहीं लेनी चाहिए। हम इस उपकरण पर निर्भरता से होने वाले किसी भी फसल के नुकसान या वित्तीय क्षति के लिए उत्तरदायी नहीं हैं।
kn: ಕ್ರಾಪ್ ಡಾಕ್ಟರ್ ಎಐ ಒದಗಿಸಿದ ಫಲಿತಾಂಶಗಳು ಮಾಹಿತಿ ಉದ್ದೇಶಗಳಿಗಾಗಿ ಮಾತ್ರ. ನಾವು ನಿಖರತೆಗಾಗಿ ಶ್ರಮಿಸುತ್ತಿರುವಾಗ, ಈ ಉಪಕರಣವು ವೃತ್ತಿಪರ ಕೃಷಿ ಸಲಹೆ ಅಥವಾ ಪ್ರಯೋಗಾಲಯ ಪರೀಕ್ಷೆಯನ್ನು ಬದಲಾಯಿಸಬಾರದು. ಈ ಉಪಕರಣದ ಮೇಲಿನ ಅವಲಂಬನೆಯಿಂದ ಉಂಟಾದ ಯಾವುದೇ ಬೆಳೆ ನಷ್ಟ ಅಥವಾ ಆರ್ಥಿಕ ಹಾನಿಗೆ ನಾವು ಜವಾಬ್ದಾರರಾಗಿರುವುದಿಲ್ಲ.
mr: क्रॉप डॉक्टर एआय द्वारे प्रदान केलेले परिणाम केवळ माहितीच्या उद्देशासाठी आहेत. आम्ही अचूकतेसाठी प्रयत्न करत असताना, हे साधन व्यावसायिक कृषी सल्ला किंवा लॅब चाचणीची जागा घेऊ नये. या साधनावर अवलंबून राहिल्यामुळे होणाऱ्या कोणत्याही पिकाच्या नुकसानास किंवा आर्थिक हानीस आम्ही जबाबदार नाही.

source: User Conduct
hi: उपयोगकर्ता आचरण
kn: ಬಳಕೆದಾರ ನಡವಳಿಕೆ
mr: वापरकर्ता वर्तन

source: You agree not to upload malicious code, illegal content, or images that do not belong to you.
hi: आप दुर्भावनापूर्ण कोड, अवैध सामग्री, या ऐसी छवियां अपलोड नहीं करने के लिए सहमत हैं जो आपकी नहीं हैं।
kn: ನಿಮಗೆ ಸೇರಿರದ ದುರುದ್ದೇಶಪೂರಿತ ಕೋಡ್, ಕಾನೂನುಬಾಹಿರ ವಿಷಯ ಅಥವಾ ಚಿತ್ರಗಳನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡದಿರಲು ನೀವು ಒಪ್ಪುತ್ತೀರಿ.
mr: तुम्ही दुर्भावनापूर्ण कोड, बेकायदेशीर सामग्री किंवा तुमच्या मालकीच्या नसलेल्या प्रतिमा अपलोड न करण्यास सहमत आहात.

source: Changes to Terms
hi: शर्तों में बदलाव
kn: ನಿಯಮಗಳಲ್ಲಿ ಬದಲಾವಣೆಗಳು
mr: अटींमध्ये बदल

source: We reserve the right to modify these terms at any time. Continued use of the service constitutes acceptance of new terms.
hi: हम किसी भी समय इन शर्तों को संशोधित करने का अधिकार सुरक्षित रखते हैं। सेवा का निरंतर उपयोग नई शर्तों की स्वीकृति का गठन करता है।
kn: ಯಾವುದೇ ಸಮಯದಲ್ಲಿ ಈ ನಿಯಮಗಳನ್ನು ಮಾರ್ಪಡಿಸುವ ಹಕ್ಕನ್ನು ನಾವು ಕಾಯ್ದಿರಿಸಿದ್ದೇವೆ. ಸೇವೆಯ ಮುಂದುವರಿದ ಬಳಕೆಯು ಹೊಸ ನಿಯಮಗಳ ಸ್ವೀಕಾರವನ್ನು ರೂಪಿಸುತ್ತದೆ.
mr: आम्ही कोणत्याही वेळी या अटींमध्ये सुधारणा करण्याचा अधिकार राखून ठेवतो. सेवेचा सतत वापर नवीन अटींची स्वीकृती दर्शवतो.

source: Information We Collect
hi: जानकारी जो हम एकत्र करते हैं
kn: ನಾವು ಸಂಗ್ರಹಿಸುವ ಮಾಹಿತಿ
mr: आम्ही गोळा करत असलेली माहिती

source: We strictly limit the data we collect. When you use Crop Doctor AI, we may process:
hi: हम जो डेटा एकत्र करते हैं उसे सख्ती से सीमित करते हैं। जब आप क्रॉप डॉक्टर एआई का उपयोग करते हैं, तो हम संसाधित कर सकते हैं:
kn: ನಾವು ಸಂಗ್ರಹಿಸುವ ಡೇಟಾವನ್ನು ನಾವು ಕಟ್ಟುನಿಟ್ಟಾಗಿ ಮಿತಿಗೊಳಿಸುತ್ತೇವೆ. ನೀವು ಕ್ರಾಪ್ ಡಾಕ್ಟರ್ AI ಅನ್ನು ಬಳಸುವಾಗ, ನಾವು ಪ್ರಕ್ರಿಯೆಗೊಳಿಸಬಹುದು:
mr: आम्ही गोळा करत असलेला डेटा आम्ही काटेकोरपणे मर्यादित करतो. जेव्हा तुम्ही क्रॉप डॉक्टर एआय वापरता, तेव्हा आम्ही प्रक्रिया करू शकतो:

source: Images:
hi: छवियां:
kn: ಚಿತ್ರಗಳು:
mr: इमेज:

source: Photos of crops you upload for diagnosis.
hi: निदान के लिए आपके द्वारा अपलोड की गई फसलों की तस्वीरें।
kn: ರೋಗನಿರ್ಣಯಕ್ಕಾಗಿ ನೀವು ಅಪ್‌ಲೋಡ್ ಮಾಡುವ ಬೆಳೆಗಳ ಫೋಟೋಗಳು.
mr: निदानासाठी तुम्ही अपलोड केलेले पिकांचे फोटो.

source: Device Data:
hi: डिवाइस डेटा:
kn: ಸಾಧನ ಡೇಟಾ:
mr: डिव्हाइस डेटा:

source: Basic information for analytics (e.g., browser type).
hi: विश्लेषण के लिए बुनियादी जानकारी (जैसे, ब्राउज़र प्रकार)।
kn: ವಿಶ್ಲೇಷಣೆಗಾಗಿ ಮೂಲ ಮಾಹಿತಿ (ಉದಾ., ಬ್ರೌಸರ್ ಪ್ರಕಾರ).
mr: विश्लेषणासाठी मूलभूत माहिती (उदा., ब्राउझर प्रकार).

source: How We Use Your Images
hi: हम आपकी छवियों का उपयोग कैसे करते हैं
kn: ನಿಮ್ಮ ಚಿತ್ರಗಳನ್ನು ನಾವು ಹೇಗೆ ಬಳಸುತ್ತೇವೆ
mr: आम्ही तुमच्या इमेज कशा वापरतो

source: Your privacy is our priority. Images uploaded for diagnosis are processed temporarily to provide results.
hi: आपकी गोपनीयता हमारी प्राथमिकता है। निदान के लिए अपलोड की गई छवियों को परिणाम प्रदान करने के लिए अस्थायी रूप से संसाधित किया जाता है।
kn: ನಿಮ್ಮ ಗೌಪ್ಯತೆ ನಮ್ಮ ಆದ್ಯತೆಯಾಗಿದೆ. ಫಲಿತಾಂಶಗಳನ್ನು ಒದಗಿಸಲು ರೋಗನಿರ್ಣಯಕ್ಕಾಗಿ ಅಪ್‌ಲೋಡ್ ಮಾಡಲಾದ ಚಿತ್ರಗಳನ್ನು ತಾತ್ಕಾಲಿಕವಾಗಿ ಪ್ರಕ್ರಿಯೆಗೊಳಿಸಲಾಗುತ್ತದೆ.
mr: तुमची गोपनीयता आमची प्राथमिकता आहे. परिणाम प्रदान करण्यासाठी निदानासाठी अपलोड केलेल्या इमेजवर तात्पुरती प्रक्रिया केली जाते.

source: Important Note:
hi: महत्वपूर्ण नोट:
kn: ಪ್ರಮುಖ ಟಿಪ್ಪಣಿ:
mr: महत्वाची टीप:

source: We do not sell your personal photos. Images are used solely for generating the disease diagnosis report.
hi: हम आपकी व्यक्तिगत तस्वीरें नहीं बेचते हैं। छवियों का उपयोग केवल रोग निदान रिपोर्ट तैयार करने के लिए किया जाता है।
kn: ನಿಮ್ಮ ವೈಯಕ್ತಿಕ ಫೋಟೋಗಳನ್ನು ನಾವು ಮಾರಾಟ ಮಾಡುವುದಿಲ್ಲ. ರೋಗನಿರ್ಣಯ ವರದಿಯನ್ನು ರಚಿಸಲು ಮಾತ್ರ ಚಿತ್ರಗಳನ್ನು ಬಳಸಲಾಗುತ್ತದೆ.
mr: आम्ही तुमचे वैयक्तिक फोटो विकत नाही. इमेज केवळ रोग निदान अहवाल तयार करण्यासाठी वापरल्या जातात.

source: Local Storage
hi: स्थानीय भंडारण
kn: ಸ್ಥಳೀಯ ಸಂಗ್ರಹಣೆ
mr: स्थानिक संचयन

source: To improve performance (Offline Mode), some data models and history logs are stored locally on your device's browser. You can clear this anytime via your browser settings.
hi: प्रदर्शन (ऑफलाइन मोड) को बेहतर बनाने के लिए, कुछ डेटा मॉडल और इतिहास लॉग आपके डिवाइस के ब्राउज़र पर स्थानीय रूप से संग्रहीत किए जाते हैं। आप इसे अपनी ब्राउज़र सेटिंग के माध्यम से कभी भी साफ़ कर सकते हैं।
kn: ಕಾರ್ಯಕ್ಷಮತೆಯನ್ನು ಸುಧಾರಿಸಲು (ಆಫ್‌ಲೈನ್ ಮೋಡ್), ಕೆಲವು ಡೇಟಾ ಮಾದರಿಗಳು ಮತ್ತು ಇತಿಹಾಸ ಲಾಗ್‌ಗಳನ್ನು ನಿಮ್ಮ ಸಾಧನದ ಬ್ರೌಸರ್‌ನಲ್ಲಿ ಸ್ಥಳೀಯವಾಗಿ ಸಂಗ್ರಹಿಸಲಾಗುತ್ತದೆ. ನಿಮ್ಮ ಬ್ರೌಸರ್ ಸೆಟ್ಟಿಂಗ್‌ಗಳ ಮೂಲಕ ನೀವು ಇದನ್ನು ಯಾವಾಗ ಬೇಕಾದರೂ ತೆರವುಗೊಳಿಸಬಹುದು.
mr: कार्यक्षमता सुधारण्यासाठी (ऑफलाइन मोड), काही डेटा मॉडेल्स आणि इतिहास लॉग तुमच्या डिव्हाइसच्या ब्राउझरवर स्थानिकरित्या संग्रहित केले जातात. तुम्ही तुमच्या ब्राउझर सेटिंग्जद्वारे हे कधीही साफ करू शकता.

source: Contact Us
hi: संपर्क करें
kn: ನಮ್ಮನ್ನು ಸಂಪರ್ಕಿಸಿ
mr: आमच्याशी संपर्क साधा

source: If you have questions about this policy, please contact us at
hi: यदि इस नीति के बारे में आपके कोई प्रश्न हैं, तो कृपया हमसे संपर्क करें
kn: ಈ ನೀತಿಯ ಕುರಿತು ನೀವು ಪ್ರಶ್ನೆಗಳನ್ನು ಹೊಂದಿದ್ದರೆ, ದಯವಿಟ್ಟು ನಮ್ಮನ್ನು ಇಲ್ಲಿ ಸಂಪರ್ಕಿಸಿ
mr: या धोरणाबद्दल तुम्हाला काही प्रश्न असल्यास, कृपया आमच्याशी येथे संपर्क साधा

source: Dr. Crop is thinking
hi: डॉ. क्रॉप सोच रहे हैं...
kn: ಡಾ. ಕ್ರಾಪ್ ಯೋಚಿಸುತ್ತಿದ್ದಾರೆ...
mr: डॉ. क्रॉप विचार करत आहेत...

source: About Crop Disease Detection App
hi: फसल रोग पहचान ऐप के बारे में
kn: ಬೆಳೆ ರೋಗ ಪತ್ತೆ ಅಪ್ಲಿಕೇಶನ್ ಬಗ್ಗೆ
mr: पीक रोग निदान ॲप बद्दल

source: Application Overview
hi: एप्लिकेशन अवलोकन
kn: ಅಪ್ಲಿಕೇಶನ್ ಅವಲೋಕನ
mr: अॅप्लिकेशन विहंगावलोकन

source: The Crop Disease Detection App is an innovative tool designed to assist farmers and agricultural enthusiasts in identifying common plant leaf diseases using advanced machine learning models. Our goal is to provide quick, accessible, and preliminary diagnoses to help in timely intervention and better crop management.
hi: फसल रोग पहचान ऐप एक अभिनव उपकरण है जिसे किसानों और कृषि उत्साही लोगों को उन्नत मशीन लर्निंग मॉडल का उपयोग करके सामान्य पौधों की पत्तियों के रोगों की पहचान करने में सहायता करने के लिए डिज़ाइन किया गया है।
kn: ಬೆಳೆ ರೋಗ ಪತ್ತೆ ಅಪ್ಲಿಕೇಶನ್ ಸುಧಾರಿತ ಯಂತ್ರ ಕಲಿಕೆ ಮಾದರಿಗಳನ್ನು ಬಳಸಿಕೊಂಡು ಸಾಮಾನ್ಯ ಸಸ್ಯ ಎಲೆ ರೋಗಗಳನ್ನು ಗುರುತಿಸಲು ರೈತರಿಗೆ ಸಹಾಯ ಮಾಡಲು ವಿನ್ಯಾಸಗೊಳಿಸಲಾದ ನವೀನ ಸಾಧನವಾಗಿದೆ.
mr: पीक रोग निदान ॲप हे शेतकऱ्यांना आणि कृषी प्रेमींना प्रगत मशीन लर्निंग मॉडेल वापरून सामान्य वनस्पतींच्या पानांच्या रोगांची ओळख पटवण्यात मदत करण्यासाठी डिझाइन केलेले एक नाविन्यपूर्ण साधन आहे.

source: Key Features:
hi: प्रमुख विशेषताऐं:
kn: ಪ್ರಮುಖ ಲಕ್ಷಣಗಳು:
mr: महत्वाची वैशिष्ट्ये:

source: AI-powered disease detection for various crops.
hi: विभिन्न फसलों के लिए एआई-संचालित रोग पहचान।
kn: ವಿವಿಧ ಬೆಳೆಗಳಿಗೆ ಎಐ-ಚಾಲಿತ ರೋಗ ಪತ್ತೆ.
mr: विविध पिकांसाठी एआय-आधारित रोग ओळख.

source: Image upload and live camera capture capabilities (browser dependent).
hi: छवि अपलोड और लाइव कैमरा कैप्चर क्षमताएं (ब्राउज़र पर निर्भर)।
kn: ಚಿತ್ರ ಅಪ್‌ಲೋಡ್ ಮತ್ತು ಲೈವ್ ಕ್ಯಾಮೆರಾ ಸೆರೆಹಿಡಿಯುವ ಸಾಮರ್ಥ್ಯಗಳು.
mr: इमेज अपलोड आणि लाइव्ह कॅमेरा कॅप्चर क्षमता.

source: Image enhancement tools for better analysis.
hi: बेहतर विश्लेषण के लिए छवि सुधार उपकरण।
kn: ಉತ್ತಮ ವಿಶ್ಲೇಷಣೆಗಾಗಿ ಚಿತ್ರ ವರ್ಧನೆ ಉಪಕರಣಗಳು.
mr: चांगल्या विश्लेषणासाठी इमेज सुधारणा साधने.

source: Detailed diagnosis reports with confidence scores and treatment suggestions.
hi: विश्वास स्कोर और उपचार सुझावों के साथ विस्तृत निदान रिपोर्ट।
kn: ವಿಶ್ವಾಸಾರ್ಹ ಅಂಕಗಳು ಮತ್ತು ಚಿಕಿತ್ಸಾ ಸಲಹೆಗಳೊಂದಿಗೆ ವಿವರವಾದ ರೋಗನಿರ್ಣಯ ವರದಿಗಳು.
mr: आत्मविश्वास स्कोअर आणि उपचार सूचनांसह तपशीलवार निदान अहवाल.

source: History tracking of past diagnoses.
hi: पिछले निदानों का इतिहास ट्रैकिंग।
kn: ಹಿಂದಿನ ರೋಗನಿರ್ಣಯಗಳ ಇತಿಹಾಸ ಟ್ರ್ಯಾಕಿಂಗ್.
mr: मागील निदानांचा इतिहास.

source: User feedback system for continuous improvement.
hi: निरंतर सुधार के लिए उपयोगकर्ता प्रतिक्रिया प्रणाली।
kn: ನಿರಂತರ ಸುಧಾರಣೆಗಾಗಿ ಬಳಕೆದಾರರ ಪ್ರತಿಕ್ರಿಯೆ ವ್ಯವಸ್ಥೆ.
mr: सतत सुधारणेसाठी वापरकर्ता अभिप्राय प्रणाली.

source: Development Information:
hi: विकास जानकारी:
kn: ಅಭಿವೃದ್ಧಿ ಮಾಹಿತಿ:
mr: विकास माहिती:

source: Developed by: [AYUSH CHOUBEY]
hi: विकसित: [आयुष चौबे]
kn: ಅಭಿವೃದ್ಧಿಪಡಿಸಿದವರು: [ಆಯುಷ್ ಚೌಬೆ]
mr: विकसक: [आयुष चौबे]

source: Version: 1.0.0
hi: संस्करण: 1.0.0
kn: ಆವೃತ್ತಿ: 1.0.0
mr: आवृत्ती: 1.0.0

source: Release Date: January 13, 2026
hi: रिलीज़ की तारीख: 13 जनवरी, 2026
kn: ಬಿಡುಗಡೆ ದಿನಾಂಕ: ಜನವರಿ 13, 2026
mr: प्रकाशन तारीख: 13 जानेवारी, 2026

source: Technologies Used:
hi: प्रयुक्त प्रौद्योगिकियां:
kn: ಬಳಸಲಾದ ತಂತ್ರಜ್ಞಾನಗಳು:
mr: वापरलेले तंत्रज्ञान:

source: Contact Us:
hi: संपर्क करें:
kn: ನಮ್ಮನ್ನು ಸಂಪರ್ಕಿಸಿ:
mr: संपर्क साधा:

source: For support or inquiries, please contact:
hi: समर्थन या पूछताछ के लिए, कृपया संपर्क करें:
kn: ಬೆಂಬಲ ಅಥವಾ ವಿಚಾರಣೆಗಾಗಿ, ದಯವಿಟ್ಟು ಸಂಪರ್ಕಿಸಿ:
mr: समर्थन किंवा चौकशीसाठी, कृपया संपर्क साधा:

source: Visit our website/repository:
hi: हमारी वेबसाइट/रिपॉजिटरी पर जाएं:
kn: ನಮ್ಮ ವೆಬ್‌ಸೈಟ್‌ಗೆ ಭೇಟಿ ನೀಡಿ:
mr: आमच्या वेबसाइटला भेट द्या:

source: Disclaimer:
hi: अस्वीकरण:
kn: ಹಕ್ಕು ನಿರಾಕರಣೆ:
mr: अस्वीकरण:

source: This application is a diagnostic aid and should not replace professional agricultural advice. Always consult with a qualified agronomist or plant pathologist for definitive diagnoses and treatment plans.
hi: यह एप्लिकेशन एक नैदानिक ​​सहायता है और इसे पेशेवर कृषि सलाह का स्थान नहीं लेना चाहिए। निश्चित निदान और उपचार योजनाओं के लिए हमेशा एक योग्य कृषि विज्ञानी से परामर्श लें।
kn: ಈ ಅಪ್ಲಿಕೇಶನ್ ರೋಗನಿರ್ಣಯದ ಸಹಾಯವಾಗಿದೆ ಮತ್ತು ವೃತ್ತಿಪರ ಕೃಷಿ ಸಲಹೆಯನ್ನು ಬದಲಿಸಬಾರದು. ನಿಖರವಾದ ರೋಗನಿರ್ಣಯ ಮತ್ತು ಚಿಕಿತ್ಸಾ ಯೋಜನೆಗಳಿಗಾಗಿ ಯಾವಾಗಲೂ ಅರ್ಹ ಕೃಷಿ ವಿಜ್ಞಾನಿಯನ್ನು ಸಂಪರ್ಕಿಸಿ.
mr: हे ॲप्लिकेशन एक निदान साहाय्य आहे आणि व्यावसायिक कृषी सल्ल्याची जागा घेऊ नये. निश्चित निदान आणि उपचार योजनांसाठी नेहमी पात्र कृषी तज्ञाचा सल्ला घ्या.

source: Plant Disease Encyclopedia
hi: पादप रोग विश्वकोश
kn: ಸಸ್ಯ ರೋಗ ವಿಶ್ವಕೋಶ
mr: वनस्पती रोग विश्वकोश

source: Browse our comprehensive database of crop diseases, symptoms, and treatments. Educate yourself to prevent outbreaks before they happen.
hi: फसल रोगों, लक्षणों और उपचारों के हमारे व्यापक डेटाबेस को ब्राउज़ करें। प्रकोप होने से पहले उन्हें रोकने के लिए खुद को शिक्षित करें।
kn: ಬೆಳೆ ರೋಗಗಳು, ಲಕ್ಷಣಗಳು ಮತ್ತು ಚಿಕಿತ್ಸೆಗಳ ನಮ್ಮ ಸಮಗ್ರ ಡೇಟಾಬೇಸ್ ಅನ್ನು ಬ್ರೌಸ್ ಮಾಡಿ.
mr: पीक रोग, लक्षणे आणि उपचारांचा आमचा सर्वसमावेशक डेटाबेस ब्राउझ करा.

source: Search for 'Apple', 'Blight', or 'Rust'...
hi: 'सेब', 'ब्लाईट', या 'रस्ट' खोजें...
kn: 'ಸೇಬು', 'ಬ್ಲೈಟ್', ಅಥವಾ 'ರಸ್ಟ್' ಗಾಗಿ ಹುಡುಕಿ...
mr: 'सफरचंद', 'ब्लाईट' किंवा 'रस्ट' शोधा...

source: KEY SYMPTOMS
hi: मुख्य लक्षण
kn: ಪ್ರಮುಖ ಲಕ್ಷಣಗಳು
mr: मुख्य लक्षणे

source: Read Full Guide
hi: पूरी गाइड पढ़ें
kn: ಸಂಪೂರ್ಣ ಮಾರ್ಗದರ್ಶಿಯನ್ನು ಓದಿ
mr: संपूर्ण मार्गदर्शक वाचा

source: Healthy
hi: स्वस्थ
kn: ಆರೋಗ್ಯಕರ
mr: निरोगी

source: Disease
hi: रोग
kn: ರೋಗ
mr: रोग

source: CropDoctor AI
hi: क्रॉप डॉक्टर एआई
kn: ಕ್ರಾಪ್ ಡಾಕ್ಟರ್ ಎಐ
mr: क्रॉप डॉक्टर एआई

source: Grow Smarter • Harvest Better
hi: होशियार बनें • बेहतर उपज पाएं
kn: ಜಾಣತನದಿಂದ ಬೆಳೆಯಿರಿ • ಉತ್ತಮ ಇಳುವರಿ ಪಡೆಯಿರಿ
mr: स्मार्ट शेती करा • अधिक उत्पन्न मिळवा

source: Listen
hi: सुने
kn: ಕೇಳಿ
mr: ऐका

source: Type or speak...
hi: टाइप करें या बोलें...
kn: ಟೈಪ್ ಮಾಡಿ ಅಥವಾ ಮಾತನಾಡಿ...
mr: टाइप करा किंवा बोला...
